shuai132/BalanceCar/STM32/system/drivers/bluenrg/src/hci.c
/**
  ******************************************************************************
  * @file    hci.c
  * @author  AMS/HESA Application Team
  * @brief   Function for managing HCI interface.
  ******************************************************************************
  *
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  */

#include "hal_types.h"
#include "osal.h"
#include "ble_status.h"
#include "hal.h"
#include "hci_const.h"
#include "gp_timer.h"
#include "stm32_bluenrg_ble.h"
#include "bluenrg_interface.h"

extern SPI_HandleTypeDef SpiHandle;

#if BLE_CONFIG_DBG_ENABLE
#define PRINTF(...) printf(__VA_ARGS__)
#else
#define PRINTF(...)
#endif

#define HCI_LOG_ON 0

#define HCI_READ_PACKET_NUM_MAX 		 (5)

#define MIN(a,b)            ((a) < (b) )? (a) : (b)
#define MAX(a,b)            ((a) > (b) )? (a) : (b)

tListNode hciReadPktPool;
tListNode hciReadPktRxQueue;
/* pool of hci read packets */
static tHciDataPacket     hciReadPacketBuffer[HCI_READ_PACKET_NUM_MAX];

static volatile uint8_t readPacketListFull=FALSE;

static volatile uint8_t hci_timer_id;
static volatile uint8_t hci_timeout;

void HCI_get_bdAddr(uint8_t *addr)
{
    /* Generate 48bit bdAddr from Unique device ID register (96 bits).
     * NOTE: Might be not unique! So change to other method if need.
     */

#define CHIP_UNIQUE_ID_REG	(0x1FFF7A10)	// move to a proper place?
    if (addr) {
        addr[0] = (*(__IO uint8_t *) CHIP_UNIQUE_ID_REG+5);
        addr[1] = (*(__IO uint8_t *) CHIP_UNIQUE_ID_REG+4);
        addr[2] = (*(__IO uint8_t *) CHIP_UNIQUE_ID_REG+3);
        addr[3] = (*(__IO uint8_t *) CHIP_UNIQUE_ID_REG+2);
        addr[4] = (*(__IO uint8_t *) CHIP_UNIQUE_ID_REG+1);
        addr[5] = (*(__IO uint8_t *) CHIP_UNIQUE_ID_REG+0);
    }
}

void hci_timeout_callback(void)
{
    hci_timeout = 1;
    return;
}

void HCI_Init(void)
{
    uint8_t index;

    /* Initialize list heads of ready and free hci data packet queues */
    list_init_head (&hciReadPktPool);
    list_init_head (&hciReadPktRxQueue);

    /* Initialize the queue of free hci data packets */
    for (index = 0; index < HCI_READ_PACKET_NUM_MAX; index++)
    {
        list_insert_tail(&hciReadPktPool, (tListNode *)&hciReadPacketBuffer[index]);
    }
}

#define HCI_PCK_TYPE_OFFSET                 0
#define  EVENT_PARAMETER_TOT_LEN_OFFSET     2

/**
 * Verify if HCI packet is correctly formatted..
 *
 * @param[in] hciReadPacket    The packet that is received from HCI interface.
 * @return 0 if HCI packet is as expected
 */
int HCI_verify(const tHciDataPacket * hciReadPacket)
{
    const uint8_t *hci_pckt = hciReadPacket->dataBuff;

    if(hci_pckt[HCI_PCK_TYPE_OFFSET] != HCI_EVENT_PKT)
        return 1;  /* Incorrect type. */

    if(hci_pckt[EVENT_PARAMETER_TOT_LEN_OFFSET] != hciReadPacket->data_len - (1+HCI_EVENT_HDR_SIZE))
        return 2; /* Wrong length (packet truncated or too long). */

    return 0;
}

void HCI_Process(void)
{
    uint8_t data_len;
    uint8_t buffer[HCI_READ_PACKET_SIZE];
    tHciDataPacket * hciReadPacket = NULL;

    Disable_SPI_IRQ();
    uint8_t list_empty = list_is_empty(&hciReadPktRxQueue);
    /* process any pending events read */
    while(list_empty == FALSE)
    {
        list_remove_head (&hciReadPktRxQueue, (tListNode **)&hciReadPacket);
        Enable_SPI_IRQ();
        HCI_Event_CB(hciReadPacket->dataBuff);
        Disable_SPI_IRQ();
        list_insert_tail(&hciReadPktPool, (tListNode *)hciReadPacket);
        list_empty = list_is_empty(&hciReadPktRxQueue);
    }
    if (readPacketListFull) {
        while(BlueNRG_DataPresent()) {
            data_len = BlueNRG_SPI_Read_All(&SpiHandle, buffer, HCI_READ_PACKET_SIZE);
            if(data_len > 0)
                HCI_Event_CB(buffer);
        }
        readPacketListFull = FALSE;
    }

    Enable_SPI_IRQ();
}

BOOL HCI_Queue_Empty(void)
{
    return list_is_empty(&hciReadPktRxQueue);
}

void HCI_Isr(void)
{
    tHciDataPacket * hciReadPacket = NULL;
    uint8_t data_len;

    Clear_SPI_EXTI_Flag();
    while(BlueNRG_DataPresent()) {
        if (list_is_empty (&hciReadPktPool) == FALSE) {

            /* enqueueing a packet for read */
            list_remove_head (&hciReadPktPool, (tListNode **)&hciReadPacket);

            data_len = BlueNRG_SPI_Read_All(&SpiHandle, hciReadPacket->dataBuff, HCI_READ_PACKET_SIZE);
            if(data_len > 0) {
                hciReadPacket->data_len = data_len;
                if(HCI_verify(hciReadPacket) == 0)
                    list_insert_tail(&hciReadPktRxQueue, (tListNode *)hciReadPacket);
                else
                    list_insert_head(&hciReadPktPool, (tListNode *)hciReadPacket);
            }
            else {
                // Insert the packet back into the pool.
                list_insert_head(&hciReadPktPool, (tListNode *)hciReadPacket);
            }

        }
        else {
            // HCI Read Packet Pool is empty, wait for a free packet.
            readPacketListFull = TRUE;
            Clear_SPI_EXTI_Flag();
            return;
        }

        Clear_SPI_EXTI_Flag();
    }
}

void hci_write(const void* data1, const void* data2, uint8_t n_bytes1, uint8_t n_bytes2) {
#if  HCI_LOG_ON
    PRINTF("HCI <- ");
    for(int i=0; i < n_bytes1; i++)
        PRINTF("%02X ", *((uint8_t*)data1 + i));
    for(int i=0; i < n_bytes2; i++)
        PRINTF("%02X ", *((uint8_t*)data2 + i));
    PRINTF("\n");
#endif

    Hal_Write_Serial(data1, data2, n_bytes1, n_bytes2);
}

void hci_send_cmd(uint16_t ogf, uint16_t ocf, uint8_t plen, void *param)
{
    hci_command_hdr hc;

    hc.opcode = htobs(cmd_opcode_pack(ogf, ocf));
    hc.plen= plen;

