shuai132/BalanceCar/STM32/system/drivers/bluenrg/src/hci.c
    uint8_t header[HCI_HDR_SIZE + HCI_COMMAND_HDR_SIZE];
    header[0] = HCI_COMMAND_PKT;
    Osal_MemCpy(header+1, &hc, sizeof(hc));

    hci_write(header, param, sizeof(header), plen);
}

static void move_list(tListNode * dest_list, tListNode * src_list)
{
    pListNode tmp_node;

    while(!list_is_empty(src_list)) {
        list_remove_head(src_list, &tmp_node);
        list_insert_tail(dest_list, tmp_node);
    }
}

int hci_send_req(struct hci_request *r, BOOL async)
{
    uint8_t *ptr;
    uint16_t opcode = htobs(cmd_opcode_pack(r->ogf, r->ocf));
    hci_event_pckt *event_pckt;
    hci_uart_pckt *hci_hdr;
    int to = DEFAULT_TIMEOUT;
    struct timer t;
    tHciDataPacket * hciReadPacket = NULL;
    tListNode hciTempQueue;

    list_init_head(&hciTempQueue);

    hci_send_cmd(r->ogf, r->ocf, r->clen, r->cparam);

    if(async) {
        goto done;
    }

    /* Minimum timeout is 1. */
    if(to == 0)
        to = 1;

    Timer_Set(&t, to);

    while(1) {
        evt_cmd_complete *cc;
        evt_cmd_status *cs;
        evt_le_meta_event *me;
        int len;

#if ENABLE_MICRO_SLEEP
        while(1) {
            ATOMIC_SECTION_BEGIN();
            if(Timer_Expired(&t)) {
                ATOMIC_SECTION_END();
                goto failed;
            }
            if(!HCI_Queue_Empty()) {
                ATOMIC_SECTION_END();
                break;
            }
            Enter_Sleep_Mode();
            ATOMIC_SECTION_END();
        }
#else
        while(1) {
            if(Timer_Expired(&t)) {
                goto failed;
            }
            if(!HCI_Queue_Empty()) {
                break;
            }
        }
#endif

        /* Extract packet from HCI event queue. */
        Disable_SPI_IRQ();
        list_remove_head(&hciReadPktRxQueue, (tListNode **)&hciReadPacket);

        hci_hdr = (void *)hciReadPacket->dataBuff;
        if(hci_hdr->type != HCI_EVENT_PKT) {
            list_insert_tail(&hciTempQueue, (tListNode *)hciReadPacket); // See comment below
            Enable_SPI_IRQ();
            continue;
        }

        event_pckt = (void *) (hci_hdr->data);

        ptr = hciReadPacket->dataBuff + (1 + HCI_EVENT_HDR_SIZE);
        len = hciReadPacket->data_len - (1 + HCI_EVENT_HDR_SIZE);

        switch (event_pckt->evt) {

        case EVT_CMD_STATUS:
            cs = (void *) ptr;

            if (cs->opcode != opcode)
                goto failed;

            if (r->event != EVT_CMD_STATUS) {
                if (cs->status) {
                    goto failed;
                }
                break;
            }

            r->rlen = MIN(len, r->rlen);
            Osal_MemCpy(r->rparam, ptr, r->rlen);
            goto done;

        case EVT_CMD_COMPLETE:
            cc = (void *) ptr;

            if (cc->opcode != opcode)
                goto failed;

            ptr += EVT_CMD_COMPLETE_SIZE;
            len -= EVT_CMD_COMPLETE_SIZE;

            r->rlen = MIN(len, r->rlen);
            Osal_MemCpy(r->rparam, ptr, r->rlen);
            goto done;

        case EVT_LE_META_EVENT:
            me = (void *) ptr;

            if (me->subevent != r->event)
                break;

            len -= 1;
            r->rlen = MIN(len, r->rlen);
            Osal_MemCpy(r->rparam, me->data, r->rlen);
            goto done;

        case EVT_HARDWARE_ERROR:
            goto failed;

        default:
            break;
        }

        /* In the meantime there could be other events from the controller.
        In this case, insert the packet in a different queue. These packets will be
        inserted back in the main queue just before exiting from send_req().
        */
        list_insert_tail(&hciTempQueue, (tListNode *)hciReadPacket);
        /* Be sure there is at list one packet in the pool to process the expected event. */
        if(list_is_empty(&hciReadPktPool)) {
            pListNode tmp_node;
            list_remove_head(&hciReadPktRxQueue, &tmp_node);
            list_insert_tail(&hciReadPktPool, tmp_node);
        }

        Enable_SPI_IRQ();

    }

failed:
    move_list(&hciReadPktRxQueue, &hciTempQueue);
    Enable_SPI_IRQ();
    return -1;

done:
    // Insert the packet back into the pool.
    list_insert_head(&hciReadPktPool, (tListNode *)hciReadPacket);
    move_list(&hciReadPktRxQueue, &hciTempQueue);

    Enable_SPI_IRQ();
    return 0;
}

int hci_reset()
{
    struct hci_request rq;
    uint8_t status;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_HOST_CTL;
    rq.ocf = OCF_RESET;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_disconnect(uint16_t	handle, uint8_t reason)
{
    struct hci_request rq;
    disconnect_cp cp;
    uint8_t status;

    cp.handle = handle;
    cp.reason = reason;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LINK_CTL;
    rq.ocf = OCF_DISCONNECT;
    rq.cparam = &cp;
    rq.clen = DISCONNECT_CP_SIZE;
    rq.event = EVT_CMD_STATUS;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_le_read_local_version(uint8_t *hci_version, uint16_t *hci_revision, uint8_t *lmp_pal_version,
                              uint16_t *manufacturer_name, uint16_t *lmp_pal_subversion)
{
    struct hci_request rq;
    read_local_version_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_INFO_PARAM;
    rq.ocf = OCF_READ_LOCAL_VERSION;
    rq.cparam = NULL;
    rq.clen = 0;
    rq.rparam = &resp;
    rq.rlen = READ_LOCAL_VERSION_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    if (resp.status) {
        return resp.status;
    }


    *hci_version = resp.hci_version;
    *hci_revision =  btohs(resp.hci_revision);
    *lmp_pal_version = resp.lmp_pal_version;
    *manufacturer_name = btohs(resp.manufacturer_name);
    *lmp_pal_subversion = btohs(resp.lmp_pal_subversion);

