shuai132/BalanceCar/STM32/system/drivers/bluenrg/src/hci.c
    return 0;
}

int hci_le_read_buffer_size(uint16_t *pkt_len, uint8_t *max_pkt)
{
    struct hci_request rq;
    le_read_buffer_size_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_READ_BUFFER_SIZE;
    rq.cparam = NULL;
    rq.clen = 0;
    rq.rparam = &resp;
    rq.rlen = LE_READ_BUFFER_SIZE_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    if (resp.status) {
        return resp.status;
    }

    *pkt_len = resp.pkt_len;
    *max_pkt = resp.max_pkt;

    return 0;
}

int hci_le_set_advertising_parameters(uint16_t min_interval, uint16_t max_interval, uint8_t advtype,
                                      uint8_t own_bdaddr_type, uint8_t direct_bdaddr_type, const tBDAddr direct_bdaddr, uint8_t chan_map,
                                      uint8_t filter)
{
    struct hci_request rq;
    le_set_adv_parameters_cp adv_cp;
    uint8_t status;

    Osal_MemSet(&adv_cp, 0, sizeof(adv_cp));
    adv_cp.min_interval = min_interval;
    adv_cp.max_interval = max_interval;
    adv_cp.advtype = advtype;
    adv_cp.own_bdaddr_type = own_bdaddr_type;
    adv_cp.direct_bdaddr_type = direct_bdaddr_type;
    Osal_MemCpy(adv_cp.direct_bdaddr,direct_bdaddr,sizeof(adv_cp.direct_bdaddr));
    adv_cp.chan_map = chan_map;
    adv_cp.filter = filter;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_SET_ADV_PARAMETERS;
    rq.cparam = &adv_cp;
    rq.clen = LE_SET_ADV_PARAMETERS_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_le_set_advertising_data(uint8_t length, const uint8_t data[])
{
    struct hci_request rq;
    le_set_adv_data_cp adv_cp;
    uint8_t status;

    Osal_MemSet(&adv_cp, 0, sizeof(adv_cp));
    adv_cp.length = length;
    Osal_MemCpy(adv_cp.data, data, MIN(31,length));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_SET_ADV_DATA;
    rq.cparam = &adv_cp;
    rq.clen = LE_SET_ADV_DATA_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_le_set_advertise_enable(uint8_t enable)
{
    struct hci_request rq;
    le_set_advertise_enable_cp adv_cp;
    uint8_t status;

    Osal_MemSet(&adv_cp, 0, sizeof(adv_cp));
    adv_cp.enable = enable?1:0;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_SET_ADVERTISE_ENABLE;
    rq.cparam = &adv_cp;
    rq.clen = LE_SET_ADVERTISE_ENABLE_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_le_set_scan_parameters(uint8_t	type, uint16_t interval,
                               uint16_t window, uint8_t own_bdaddr_type,
                               uint8_t	filter)
{
    struct hci_request rq;
    le_set_scan_parameters_cp scan_cp;
    uint8_t status;

    Osal_MemSet(&scan_cp, 0, sizeof(scan_cp));
    scan_cp.type = type;
    scan_cp.interval = interval;
    scan_cp.window = window;
    scan_cp.own_bdaddr_type = own_bdaddr_type;
    scan_cp.filter = filter;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_SET_SCAN_PARAMETERS;
    rq.cparam = &scan_cp;
    rq.clen = LE_SET_SCAN_PARAMETERS_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_le_set_scan_enable(uint8_t enable, uint8_t filter_dup)
{
    struct hci_request rq;
    le_set_scan_enable_cp scan_cp;
    uint8_t status;

    Osal_MemSet(&scan_cp, 0, sizeof(scan_cp));
    scan_cp.enable = enable?1:0;
    scan_cp.filter_dup = filter_dup;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_SET_SCAN_ENABLE;
    rq.cparam = &scan_cp;
    rq.clen = LE_SET_SCAN_ENABLE_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_le_rand(uint8_t random_number[8])
{
    struct hci_request rq;
    le_rand_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_RAND;
    rq.cparam = NULL;
    rq.clen = 0;
    rq.rparam = &resp;
    rq.rlen = LE_RAND_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    if (resp.status) {
        return resp.status;
    }

    Osal_MemCpy(random_number, resp.random, 8);

    return 0;
}

int hci_le_set_scan_resp_data(uint8_t length, const uint8_t data[])
{
    struct hci_request rq;
    le_set_scan_response_data_cp scan_resp_cp;
    uint8_t status;

    Osal_MemSet(&scan_resp_cp, 0, sizeof(scan_resp_cp));
    scan_resp_cp.length = length;
    Osal_MemCpy(scan_resp_cp.data, data, MIN(31,length));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_SET_SCAN_RESPONSE_DATA;
    rq.cparam = &scan_resp_cp;
    rq.clen = LE_SET_SCAN_RESPONSE_DATA_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_le_read_advertising_channel_tx_power(int8_t *tx_power_level)
{
    struct hci_request rq;
    le_read_adv_channel_tx_power_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_READ_ADV_CHANNEL_TX_POWER;
    rq.cparam = NULL;
    rq.clen = 0;
    rq.rparam = &resp;
    rq.rlen = LE_RAND_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    if (resp.status) {
        return resp.status;
    }

    *tx_power_level = resp.level;

    return 0;
}

int hci_le_set_random_address(tBDAddr bdaddr)
{
    struct hci_request rq;
    le_set_random_address_cp set_rand_addr_cp;
    uint8_t status;

    Osal_MemSet(&set_rand_addr_cp, 0, sizeof(set_rand_addr_cp));
    Osal_MemCpy(set_rand_addr_cp.bdaddr, bdaddr, sizeof(tBDAddr));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_SET_RANDOM_ADDRESS;
    rq.cparam = &set_rand_addr_cp;
    rq.clen = LE_SET_RANDOM_ADDRESS_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

