shuai132/BalanceCar/STM32/system/drivers/bluenrg/src/hci.c
    return status;
}

int hci_read_bd_addr(tBDAddr bdaddr)
{
    struct hci_request rq;
    read_bd_addr_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_INFO_PARAM;
    rq.ocf = OCF_READ_BD_ADDR;
    rq.cparam = NULL;
    rq.clen = 0;
    rq.rparam = &resp;
    rq.rlen = READ_BD_ADDR_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    if (resp.status) {
        return resp.status;
    }
    Osal_MemCpy(bdaddr, resp.bdaddr, sizeof(tBDAddr));

    return 0;
}

int hci_le_create_connection(uint16_t interval,	uint16_t window, uint8_t initiator_filter, uint8_t peer_bdaddr_type,
                             const tBDAddr peer_bdaddr,	uint8_t	own_bdaddr_type, uint16_t min_interval,	uint16_t max_interval,
                             uint16_t latency,	uint16_t supervision_timeout, uint16_t min_ce_length, uint16_t max_ce_length)
{
    struct hci_request rq;
    le_create_connection_cp create_cp;
    uint8_t status;

    Osal_MemSet(&create_cp, 0, sizeof(create_cp));
    create_cp.interval = interval;
    create_cp.window =  window;
    create_cp.initiator_filter = initiator_filter;
    create_cp.peer_bdaddr_type = peer_bdaddr_type;
    Osal_MemCpy(create_cp.peer_bdaddr, peer_bdaddr, sizeof(tBDAddr));
    create_cp.own_bdaddr_type = own_bdaddr_type;
    create_cp.min_interval=min_interval;
    create_cp.max_interval=max_interval;
    create_cp.latency = latency;
    create_cp.supervision_timeout=supervision_timeout;
    create_cp.min_ce_length=min_ce_length;
    create_cp.max_ce_length=max_ce_length;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_CREATE_CONN;
    rq.cparam = &create_cp;
    rq.clen = LE_CREATE_CONN_CP_SIZE;
    rq.event = EVT_CMD_STATUS;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return status;
}

int hci_le_encrypt(uint8_t key[16], uint8_t plaintextData[16], uint8_t encryptedData[16])
{
    struct hci_request rq;
    le_encrypt_cp params;
    le_encrypt_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemCpy(params.key, key, 16);
    Osal_MemCpy(params.plaintext, plaintextData, 16);

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_ENCRYPT;
    rq.cparam = &params;
    rq.clen = LE_ENCRYPT_CP_SIZE;
    rq.rparam = &resp;
    rq.rlen = LE_ENCRYPT_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    if (resp.status) {
        return resp.status;
    }

    Osal_MemCpy(encryptedData, resp.encdata, 16);

    return 0;
}

int hci_le_ltk_request_reply(uint8_t key[16])
{
    struct hci_request rq;
    le_ltk_reply_cp params;
    le_ltk_reply_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    params.handle = 1;
    Osal_MemCpy(params.key, key, 16);

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_LTK_REPLY;
    rq.cparam = &params;
    rq.clen = LE_LTK_REPLY_CP_SIZE;
    rq.rparam = &resp;
    rq.rlen = LE_LTK_REPLY_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return resp.status;
}

int hci_le_ltk_request_neg_reply()
{
    struct hci_request rq;
    le_ltk_neg_reply_cp params;
    le_ltk_neg_reply_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    params.handle = 1;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_LTK_NEG_REPLY;
    rq.cparam = &params;
    rq.clen = LE_LTK_NEG_REPLY_CP_SIZE;
    rq.rparam = &resp;
    rq.rlen = LE_LTK_NEG_REPLY_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0)
        return BLE_STATUS_TIMEOUT;

    return resp.status;
}

int hci_le_read_white_list_size(uint8_t *size)
{
    struct hci_request rq;
    le_read_white_list_size_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_READ_WHITE_LIST_SIZE;
    rq.rparam = &resp;
    rq.rlen = LE_READ_WHITE_LIST_SIZE_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    if (resp.status) {
        return resp.status;
    }

    *size = resp.size;

    return 0;
}

int hci_le_clear_white_list()
{
    struct hci_request rq;
    uint8_t status;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_CLEAR_WHITE_LIST;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    return status;
}

int hci_le_add_device_to_white_list(uint8_t	bdaddr_type, tBDAddr bdaddr)
{
    struct hci_request rq;
    le_add_device_to_white_list_cp params;
    uint8_t status;

    params.bdaddr_type = bdaddr_type;
    Osal_MemCpy(params.bdaddr, bdaddr, 6);

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_ADD_DEVICE_TO_WHITE_LIST;
    rq.cparam = &params;
    rq.clen = LE_ADD_DEVICE_TO_WHITE_LIST_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    return status;
}

int hci_le_remove_device_from_white_list(uint8_t bdaddr_type, tBDAddr bdaddr)
{
    struct hci_request rq;
    le_remove_device_from_white_list_cp params;
    uint8_t status;

    params.bdaddr_type = bdaddr_type;
    Osal_MemCpy(params.bdaddr, bdaddr, 6);

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_REMOVE_DEVICE_FROM_WHITE_LIST;
    rq.cparam = &params;
    rq.clen = LE_REMOVE_DEVICE_FROM_WHITE_LIST_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    return status;
}

int hci_read_transmit_power_level(uint16_t *conn_handle, uint8_t type, int8_t * tx_level)
{
    struct hci_request rq;
    read_transmit_power_level_cp params;
    read_transmit_power_level_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    params.handle = *conn_handle;
    params.type = type;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_HOST_CTL;
    rq.ocf = OCF_READ_TRANSMIT_POWER_LEVEL;
    rq.cparam = &params;
    rq.clen = READ_TRANSMIT_POWER_LEVEL_CP_SIZE;
    rq.rparam = &resp;
    rq.rlen = READ_TRANSMIT_POWER_LEVEL_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    if (resp.status) {
        return resp.status;
    }

