shuai132/BalanceCar/STM32/system/drivers/bluenrg/src/hci.c
    *conn_handle = resp.handle;
    *tx_level = resp.level;

    return 0;
}

int hci_read_rssi(uint16_t *conn_handle, int8_t * rssi)
{
    struct hci_request rq;
    read_rssi_cp params;
    read_rssi_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    params.handle = *conn_handle;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_STATUS_PARAM;
    rq.ocf = OCF_READ_RSSI;
    rq.cparam = &params;
    rq.clen = READ_RSSI_CP_SIZE;
    rq.rparam = &resp;
    rq.rlen = READ_RSSI_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    if (resp.status) {
        return resp.status;
    }

    *conn_handle = resp.handle;
    *rssi = resp.rssi;

    return 0;
}

int hci_le_read_local_supported_features(uint8_t *features)
{
    struct hci_request rq;
    le_read_local_supported_features_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_READ_LOCAL_SUPPORTED_FEATURES;
    rq.rparam = &resp;
    rq.rlen = LE_READ_LOCAL_SUPPORTED_FEATURES_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    if (resp.status) {
        return resp.status;
    }

    Osal_MemCpy(features, resp.features, sizeof(resp.features));

    return 0;
}

int hci_le_read_channel_map(uint16_t conn_handle, uint8_t ch_map[5])
{
    struct hci_request rq;
    le_read_channel_map_cp params;
    le_read_channel_map_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    params.handle = conn_handle;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_READ_CHANNEL_MAP;
    rq.cparam = &params;
    rq.clen = LE_READ_CHANNEL_MAP_CP_SIZE;
    rq.rparam = &resp;
    rq.rlen = LE_READ_CHANNEL_MAP_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    if (resp.status) {
        return resp.status;
    }

    Osal_MemCpy(ch_map, resp.map, 5);

    return 0;
}

int hci_le_read_supported_states(uint8_t states[8])
{
    struct hci_request rq;
    le_read_supported_states_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_READ_SUPPORTED_STATES;
    rq.rparam = &resp;
    rq.rlen = LE_READ_SUPPORTED_STATES_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    if (resp.status) {
        return resp.status;
    }

    Osal_MemCpy(states, resp.states, 8);

    return 0;
}

int hci_le_receiver_test(uint8_t frequency)
{
    struct hci_request rq;
    le_receiver_test_cp params;
    uint8_t status;

    params.frequency = frequency;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_RECEIVER_TEST;
    rq.cparam = &params;
    rq.clen = LE_RECEIVER_TEST_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    return status;
}

int hci_le_transmitter_test(uint8_t frequency, uint8_t length, uint8_t payload)
{
    struct hci_request rq;
    le_transmitter_test_cp params;
    uint8_t status;

    params.frequency = frequency;
    params.length = length;
    params.payload = payload;

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_TRANSMITTER_TEST;
    rq.cparam = &params;
    rq.clen = LE_TRANSMITTER_TEST_CP_SIZE;
    rq.rparam = &status;
    rq.rlen = 1;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    return status;
}

int hci_le_test_end(uint16_t *num_pkts)
{
    struct hci_request rq;
    le_test_end_rp resp;

    Osal_MemSet(&resp, 0, sizeof(resp));

    Osal_MemSet(&rq, 0, sizeof(rq));
    rq.ogf = OGF_LE_CTL;
    rq.ocf = OCF_LE_TEST_END;
    rq.rparam = &resp;
    rq.rlen = LE_TEST_END_RP_SIZE;

    if (hci_send_req(&rq, FALSE) < 0) {
        return BLE_STATUS_TIMEOUT;
    }

    if (resp.status) {
        return resp.status;
    }

    *num_pkts = resp.num_pkts;

    return 0;
}
